import numpy as np

# 假设有10个类别,编号分别为0,1,2,3,4,5,6,7,8,9
a = np.eye(10)

print('\n如果对应的类别号是2，那么转成one-hot的形式:', a[2])
print('如果对应的类别号是3，那么转成one-hot的形式:', a[3])

labels = [2, 5, 8, 6]
print('\n如果对应的类别号是2, 5, 8, 6, 那么转成one-hot的形式\n')
print(a[labels])



'''
如果对应的类别号是2，那么转成one-hot的形式: [0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
如果对应的类别号是3，那么转成one-hot的形式: [0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]

如果对应的类别号是2, 5, 8, 6, 那么转成one-hot的形式

[[0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 0. 0. 1. 0. 0. 0.]]
'''
